import BlogPostPage from "@/app/components/BlogPostPage";

const posts = [
  {
    id: 1,
    title: "Як народжуються наші унікальні сумки ♻️",
    date: "10 жовтня 2025",
    content: `
      Ми розповідаємо, як старий одяг отримує друге життя — від підбору тканин до створення стильних хендмейд-сумок.
      <br /><br />
      Усе починається з пошуку якісних матеріалів, які вже були у вжитку. Потім ми ретельно підбираємо кольори, фактури й деталі, щоб створити щось справді особливе.
      <br /><br />
      Кожна сумка має свою історію, і ми раді ділитися нею з вами 💛
    `,
    image: "/test2.jpg",
  },
  {
    id: 2,
    title: "5 причин обрати сумку з перешитого одягу 🌿",
    date: "2 жовтня 2025",
    content: `
      Екологічність, унікальність, стиль і турбота про планету — ось чому ми любимо апсайклінг.
      <br /><br />
      Кожен виріб створений вручну, без шкідливих відходів і надлишкового виробництва. 
      Ви отримуєте не просто річ — а частинку свідомої моди 🌱
    `,
    image: "/test4.jpg",
  },
  {
    id: 3,
    title: "Як ми створюємо дизайн кожної моделі 🎨",
    date: "25 вересня 2025",
    content: `
      Усе починається з ідеї. Ми створюємо ескізи, експериментуємо з формами та кольорами.
      <br /><br />
      Потім відбираємо матеріали, які вже мають історію, і вдихаємо в них нове життя. Кожна модель — результат натхнення, праці та любові до деталей 💫
    `,
    image: "/test1.jpg",
  },
];

export default async function BlogDetailsWrapper({ params }) {
  const { id } = await params; // отримуємо id з URL
  console.log(id);
  // const blog = await getProductById(id);

  // if (!product) {
  //   return <p>Taki blog nie istnieje.</p>;
  // }

  return <BlogPostPage post={posts[id - 1]} />;
}
